[
    {
        "text": "Amazing game; this is a perfect example of steams early access system being used ethically and appropriately. We need to support and empower more dev teams like this as they have shown not only that they value their player base, but that they are willing to sell their game at a price that is affordable, reasonable for early access, and great value for money. Keep up the good work Unknown Origin Games Inc."
    },
    {
        "text": "Great game excellent UI design highly polished and stable but short on things that would make the world feel more alive. Dwarf Fortress has such an insane depth in terms of weird mechanics and integrations and this is not even 10 of that. Luckily its still in early access and this is probably the best moment to get the game The dev seems friendly and responsive to feedback and as far as I can tell they are really trying to make something great. Ill most definitely be back once more events and just dwarf fortress-like weird mechanics and synergies are added."
    },
    {
        "text": "Odd Realm is an incredibly appealing game. The artwork is charming and the systems in place are very well done. Some may call it a Dwarf Fortress-light but seriously what game isnt DF has been in development for more than a decade Its an unfair comparison for sure Odd Realm scratches that itch of building and managing a village castle or an underground fortress Its got building farming mining fishing trading crafting taming fighting z-levels different starting races magic and seasons Building is very well thought-out and easier than in most games of the genre because the units can climb walls and get out of holes without scaffolding or ladders The uniform management is efficient and the crafting isnt overwhelming The developer is actively working on adding more content as well as QoL improvements regularly and the game keeps getting better and better Wholeheartedly recommended."
    },
    {
        "text": "Ive been looking for a game similar to Dwarf Fortress but nothing stuck. A lot of games that Ive tried such as Rimworld had a very unsatisfying gameplay loop to me. The closest game that I enjoyed was Gnomoria but that was ages ago. This is the first game that Ive tried out since Dwarf Fortress to get me as hooked as DF Its still in early access but I can see immense potential in this game Especially when it costs less than a visit to Subway"
    },
    {
        "text": "Bug was fixed same day by the developer Most impressive Love the soundtrack Beta fixes some issues I was having."
    },
    {
        "text": "This is dwarf fortress only actual competitor It runs better without the notorious FPS death problems that plague massive DF settlements The sprites are animated instead of static icons The world looks and feels more alive The playable races are dope"
    },
    {
        "text": "At this point I want to say that Odd Realm has stolen my heart Again I love Dwarf Fortress to bits but Odd Realm has turned into a much better experience with the potential of leaving DF in the dust Of course DF has some things at its core that will always be better than any colony management sim"
    },
    {
        "text": "So Ive had this game for years now and all I can really say is how hard the developer works to keep trucking along with this game Very impressed with it If you are a Dwarf Fortress fan its worth a try"
    },
    {
        "text": "As an experienced base-building player (RimWorld Dwarf Fortress Oxygen Not Included Factorio) player I think this game is shaping up really nicely The sound design in particular has me sometimes taking off my headphones to see if I heard real birds"
    },
    {
        "text": "Amazing game Looks simple on the surface but there is a lot of depth I cant speak highly enough about how fun and different each playable race has been to learn and manage The fantasy setting is sublime"
    }
]
