[
    {
        "text": "Amazing game&#59; this is a perfect example of steam&#39;s early access system being used ethically and appropriately. We need to support and empower more dev teams like this as they have shown not only that they value their player base, but that they are willing to sell their game at a price that is affordable, reasonable for early access, and great value for money. Keep up the good work Unknown Origin Games Inc."
    },
    {
        "text": "Great game&#44; excellent UI design&#44; highly polished and stable&#44; but short on things that would make the world feel more alive. Dwarf Fortress has such an insane depth in terms of weird mechanics and integrations&#44; and this is not even 10&#37; of that. Luckily&#44; it&#39;s still in early access&#44; and this is probably the best moment to get the game&#33; The dev seems friendly and responsive to feedback&#44; and as far as I can tell they are really trying to make something great. I&#39;ll most definitely be back once more events and just dwarf fortress-like weird mechanics and synergies are added."
    },
    {
        "text": "Odd Realm is an incredibly appealing game. The artwork is charming and the systems in place are very well done. Some may call it a &#39;Dwarf Fortress-light&#39;&#44; but seriously&#44; what game isn&#39;t&#63; DF has been in development for more than a decade&#46; It&#39;s an unfair comparison&#44; for sure&#33; Odd Realm scratches that itch of building and managing a village&#44; castle or an underground fortress&#46; It&#39;s got building&#44; farming&#44; mining&#44; fishing&#44; trading&#44; crafting&#44; taming&#44; fighting&#44; z-levels&#44; different starting races&#44; magic and seasons&#46; Building is very well thought-out and easier than in most games of the genre because the units can climb walls and get out of holes without scaffolding or ladders&#46; The uniform management is efficient and the crafting isn&#39;t overwhelming&#46; The developer is actively working on adding more content as well as QoL improvements regularly and the game keeps getting better and better&#46; Wholeheartedly recommended."
    },
    {
        "text": "I&#39;ve been looking for a game similar to Dwarf Fortress but nothing stuck. A lot of games that I&#39;ve tried&#44; such as Rimworld&#44; had a very unsatisfying gameplay loop to me. The closest game that I enjoyed was Gnomoria&#44; but that was ages ago. This is the first game that I&#39;ve tried out since Dwarf Fortress to get me as hooked as DF&#46; It&#39;s still in early access but I can see immense potential in this game&#46; Especially when it costs less than a visit to Subway&#46;"
    },
    {
        "text": "Bug was fixed same day by the developer&#46; Most impressive&#46; Love the soundtrack&#33; Beta fixes some issues I was having."
    },
    {
        "text": "This is dwarf fortress&#39; only actual competitor&#46; It runs better&#44; without the notorious FPS death problems that plague massive DF settlements&#46; The sprites are animated instead of static icons&#46; The world looks and feels more alive&#46; The playable races are dope&#46;"
    },
    {
        "text": "At this point I want to say that Odd Realm has stolen my heart&#46; Again&#44; I love Dwarf Fortress to bits&#44; but Odd Realm has turned into a much better experience with the potential of leaving DF in the dust&#46; Of course&#44; DF has some things at its core that will always be better than any colony management sim&#46;"
    },
    {
        "text": "So&#44; I&#39;ve had this game for years now and all I can really say is how hard the developer works to keep trucking along with this game&#46; Very impressed with it&#46; If you are a Dwarf Fortress fan it&#39;s worth a try&#46;"
    },
    {
        "text": "As an experienced base-building player &#40;RimWorld&#44; Dwarf Fortress&#44; Oxygen Not Included&#44; Factorio&#41; player&#44; I think this game is shaping up really nicely&#46; The sound design&#44; in particular&#44; has me sometimes taking off my headphones to see if I heard real birds&#46;"
    },
    {
        "text": "Amazing game&#46; Looks simple on the surface&#44; but there is a lot of depth&#46; I can&#39;t speak highly enough about how fun and different each playable race has been to learn and manage&#46; The fantasy setting is sublime&#46;"
    }
]
